In [1]:
%load_ext sql
%sql sqlite://

In [2]:
%%sql
drop table if exists product;
create table product(
       pname        varchar primary key, -- name of the product
       price        money,               -- price of the product
       category     varchar,             -- category
       manufacturer varchar NOT NULL     -- manufacturer
);
insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
SELECT *
from PRODUCT;

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[('Gizmo', 19.99, 'Gadgets', 'GizmoWorks'),
 ('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi'),
 ('SingleTouch', 149.99, 'Photography', 'Canon')]

Activity 2-2:
-------------

Single table queries

Exercise #1
-----------

Try writing a query to get an output table of all the products with "Touch" in the name, showing just their name and price, and sorted alphabetically by manufacturer.  Also think about whether or not this query is "proper" SQL or not?

Let's look at the products first:

In [3]:
%sql select * from product;

 * sqlite://
Done.

[('Gizmo', 19.99, 'Gadgets', 'GizmoWorks'),
 ('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi'),
 ('SingleTouch', 149.99, 'Photography', 'Canon')]

Write your query here:

In [4]:
%%sql
SELECT pname, price
FROM product
WHERE pname like "%Touch%"
ORDER BY manufacturer;

 * sqlite://
Done.

[('SingleTouch', 149.99), ('MultiTouch', 203.99)]

Next, write a query that returns the _distinct_ names of manufacturers that make products with "Gizmo" in the name:

In [5]:
%%sql
SELECT DISTINCT manufacturer
FROM product
WHERE pname like "%Gizmo%";

 * sqlite://
Done.

[('GizmoWorks',)]

Exercise #2:
------------

_More on ORDER BY_

Try some of these queries but first guess what they return.  Which ones are "proper" SQL?

In [6]:
%sql SELECT DISTINCT category FROM product ORDER BY category;

 * sqlite://
Done.

[('Gadgets',), ('Household',), ('Photography',)]

In [7]:
%sql SELECT category FROM product ORDER BY pname;

 * sqlite://
Done.

[('Gadgets',), ('Household',), ('Gadgets',), ('Photography',)]

In [8]:
%sql SELECT DISTINCT category FROM product ORDER BY pname;

 * sqlite://
Done.

[('Gadgets',), ('Household',), ('Photography',)]